"""Оптимізація частоти ходів ШСНУ за критерієм максимального прибутку"""
from pump_loads import *
import numpy as np
pi=np.pi

import matplotlib.pyplot as plt
import sympy as sp

η=0.27 # коефіцієнт корисної дії ШСНУ
s=2 # довжина ходу плунжера насоса (м)
n=np.linspace(0, 12) # 6.5 частота ходів, 1/хв
d=0.019 # діаметр штанг (м)
dp=0.032 # діаметр плунжера насоса (м)
ro=7850 # густина матеріалу штанг (кг/м3). сталь 7850, склопластик 2100
rof=1000 # # густина рідини (кг/м3)
L=2000 # довжина колони (м)

# розкоментуйте потрібне для отримання результатів в символьному вигляді
#pi=sp.pi
#s, n, L=sp.symbols("s n L", real=True, positive=True)
#s, n, L, d, dp, ro, rof, η=sp.symbols("s n L d dp ro rof η", real=True, positive=True)

ns=n/60 # частота, Гц
ω=2*pi*ns # кутова частота, рад/с
f=pi*d**2/4 # площа перерізу штанг (м2)
fp=pi*dp**2/4 # площа плунжера (спрощено) (м2)

P_st=L*ro*9.81*f # вага однорозмірної колони насосних штанг у повітрі (Н)
P_rd=L*rof*9.81*fp # вага стовпа рідини над плунжером (Н)
bf = 1-(rof/ro) # коефіцієнт плавучості
kd=(s*n**2)/1790 # емпіричний коефіцієнт прискорення для типового верстата-качалки
Pmin=P_st*bf * (1-kd) # мінімальне навантаження (Н) (формула Міллса)
Pmax=(P_st*bf + P_rd)*(1+kd) # максимальне навантаження (Н) (формула Кемлера)
Pmin=Pmin/1000 # кН
Pmax=Pmax/1000 # кН
#print(Pmin,Pmax)
M=30*s/100 + 0.24*s*(Pmax-Pmin) # максимальний середній крутний момент на валу кривошипа (кНм)
Nc=M*ω/η # споживна потужність (кВт)

E=Nc*0.2*24*360 #витрати на електроенергію за рік $
E+=1*n**5 # інші витрати, що залежать від n. сталь - 5, склопластик - 3
E+=100000 # витрати, що не залежать від n
nmax=1200/L**0.5 # гранична частота, що призводить до "зависання" штанг
k=0.85*(1-(n/nmax)**2) # коефіцієнт подачі насоса (0.5–0.85)
Q=(pi*dp**2/4)*s*n*k *60*24*360 # теоретична продуктивність свердловини м3/рік
#Увага! Тут s - хід плунжера, який суттєво залежить від n у склопластикових колон
I=Q*590 # доходи за рік для ціни $590 за тону
I=0.25*I # доходи без пропорційних витрат
P=I-E # чистий прибуток як різниця доходів і витрат
#print(ω,Pmin,Pmax,M,Nc,E,Q,I)

##
# розкоментуйте для символьних обчислень
"""
derP=P.diff(n) # похідна функції прибутку по змінній n
sol=sp.solve(sp.Eq(derP,0),n) # корінь рівняння derP=0 - значення n, в якому функція має екстремум (максимум)
sol=sp.simplify(sol[1])
#print(sol)
#sp.cse(sol)
nopt=sol.subs({η:0.27,s:2,d:0.019,dp:0.032,ro:7850,rof:1000,L:2000}).evalf() # число
#nopt=sol.subs({L:2000,s:2}).evalf() # число

nopt=sp.sqrt(-0.00123993652392858*L*s**2 - 0.0108899162434387*L*s + s**0.5*(1.5374425833721e-6*L**2*s**3 + 2.70056097855257e-5*L**2*s**2 + 0.000118590275789111*L**2*s - 0.25380996821729*L + 10414.1072077352)**0.5)
fnopt=sp.lambdify([L,s],nopt,'numpy')
si=np.linspace(0.5, 3)
for i,Li in enumerate([500,1000,1500,2000]):
    plt.plot(si,fnopt(Li,si),'k',linewidth=i+1)
plt.grid()
plt.xlabel("s, n")
plt.ylabel("nopt, 1/min")
plt.show()
"""

##
# графіки за чисельними обчисленнями
plt.plot(n,-E)
plt.plot(n,I,'k')
plt.plot(n,P,'--')
plt.grid()
plt.xlabel("n, 1/min")
plt.ylabel("USD equivalent")
plt.show()